# IsStartConnectorPresent Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeMultiplanarDefinition..::..IsStartConnectorPresent Property
RebarShapeMultiplanarDefinition Class See Also
---
Whether a perpendicular segment is constructed from the start of the 2D shape.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsStartConnectorPresent { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsStartConnectorPresent As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsStartConnectorPresent {
	bool get ();
}
```

# See Also
RebarShapeMultiplanarDefinition Class
Autodesk.Revit.DB.Structure Namespace